Revit 2027 API
Rebar.IsCrankLengthOverrideEnabled Method
 Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCrankLengthOverrideEnabled()
Public Function IsCrankLengthOverrideEnabled As Boolean
public:
bool IsCrankLengthOverrideEnabled()
member IsCrankLengthOverrideEnabled : unit -> bool
Return Value
Boolean
 Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace